Repository: erickisos/python-docs-es
Catalog: tutorial/venv.po
Languages: es

source: Virtual Environments and Packages
es: Entornos virtuales y paquetes

source: Introduction
es: Introducción

source: Python applications will often use packages and modules that don't come as part of the standard library. Applications will sometimes need a specific version of a library, because the application may require that a particular bug has been fixed or the application may be written using an obsolete version of the library's interface.
es: Las aplicaciones en Python usualmente hacen uso de paquetes y módulos que no forman parte de la librería estándar. Las aplicaciones a veces necesitan una versión específica de una librería, debido a que dicha aplicación requiere que un bug particular haya sido solucionado o bien la aplicación ha sido escrita usando una versión obsoleta de la interfaz de la librería.

source: This means it may not be possible for one Python installation to meet the requirements of every application. If application A needs version 1.0 of a particular module but application B needs version 2.0, then the requirements are in conflict and installing either version 1.0 or 2.0 will leave one application unable to run.
es: Esto significa que tal vez no sea posible para una instalación de Python cumplir los requerimientos de todas las aplicaciones. Si la aplicación A necesita la versión 1.0 de un módulo particular y la aplicación B necesita la versión 2.0, entonces los requerimientos entran en conflicto e instalar la versión 1.0 o 2.0 dejará una de las aplicaciones sin funcionar.

source: The solution for this problem is to create a :term:`virtual environment`, a self-contained directory tree that contains a Python installation for a particular version of Python, plus a number of additional packages.
es: La solución a este problema es crear un :term:`entorno virtual`, un directorio que contiene una instalación de Python de una versión en particular, además de unos cuantos paquetes adicionales.

source: Different applications can then use different virtual environments. To resolve the earlier example of conflicting requirements, application A can have its own virtual environment with version 1.0 installed while application B has another virtual environment with version 2.0. If application B requires a library be upgraded to version 3.0, this will not affect application A's environment.
es: Diferentes aplicaciones pueden entonces usar entornos virtuales diferentes. Para resolver el ejemplo de requerimientos en conflicto citado anteriormente, la aplicación A puede tener su propio entorno virtual con la versión 1.0 instalada mientras que la aplicación B tiene otro entorno virtual con la versión 2.0. Si la aplicación B requiere que actualizar la librería a la versión 3.0, ésto no afectará el entorno virtual de la aplicación A.

source: Creating Virtual Environments
es: Creando entornos virtuales

source: To create a virtual environment, decide upon a directory where you want to place it, and run the :mod:`venv` module as a script with the directory path::
es: Para crear un entorno virtual, decide en que carpeta quieres crearlo y ejecuta el módulo :mod:`venv` como script con la ruta a la carpeta::

source: This will create the ``tutorial-env`` directory if it doesn't exist, and also create directories inside it containing a copy of the Python interpreter and various supporting files.
es: Esto creará el directorio ``tutorial-env`` si no existe, y también creará directorios dentro de él que contienen una copia del intérprete de Python y varios archivos de soporte.

source: A common directory location for a virtual environment is ``.venv``. This name keeps the directory typically hidden in your shell and thus out of the way while giving it a name that explains why the directory exists. It also prevents clashing with ``.env`` environment variable definition files that some tooling supports.
es: Una ruta común para el directorio de un entorno virtual es ``.venv``. Ese nombre mantiene el directorio típicamente escondido en la consola y fuera de vista mientras le da un nombre que explica cuál es el motivo de su existencia. También permite que no haya conflicto con los ficheros de definición de variables de entorno ``.env`` que algunas herramientas soportan.

source: Once you've created a virtual environment, you may activate it.
es: Una vez creado el entorno virtual, podrás activarlo.

source: On Windows, run::
es: En Windows, ejecuta::

source: On Unix or MacOS, run::
es: En Unix o MacOS, ejecuta::

source: (This script is written for the bash shell. If you use the :program:`csh` or :program:`fish` shells, there are alternate ``activate.csh`` and ``activate.fish`` scripts you should use instead.)
es: (Este script está escrito para la consola bash. Si usas las consolas :program:`csh` or :program:`fish`, hay scripts alternativos ``activate.csh`` y ``activate.fish`` que deberá usar en su lugar.)

source: Activating the virtual environment will change your shell's prompt to show what virtual environment you're using, and modify the environment so that running ``python`` will get you that particular version and installation of Python. For example:
es: Activar el entorno virtual cambiará el prompt de tu consola para mostrar que entorno virtual está usando, y modificará el entorno para que al ejecutar ``python`` sea con esa versión e instalación en particular. Por ejemplo:

source: To deactivate a virtual environment, type::
es: Para desactivar el entorno virtual, digita::

source: into the terminal.
es: en el terminal.

source: Managing Packages with pip
es: Manejando paquetes con pip

source: You can install, upgrade, and remove packages using a program called :program:`pip`. By default ``pip`` will install packages from the `Python Package Index <https://pypi.org>`_. You can browse the Python Package Index by going to it in your web browser.
es: Puede instalar, actualizar y eliminar paquetes usando un programa llamado :program:`pip`. De forma predeterminada, ``pip`` instalará paquetes desde el `Indice de Paquetes de Python <https://pypi.org>`_. Puede navegar por el índice de paquetes de Python yendo a él en su navegador web.

source: ``pip`` has a number of subcommands: "install", "uninstall", "freeze", etc. (Consult the :ref:`installing-index` guide for complete documentation for ``pip``.)
es: ``pip`` tiene varios subcomandos: "install", "uninstall", "freeze", etc. (Consulte la guía :ref:`installing-index` para obtener la documentación completa de ``pip``).

source: You can install the latest version of a package by specifying a package's name:
es: Se puede instalar la última versión de un paquete especificando el nombre del paquete:

source: You can also install a specific version of a package by giving the package name followed by ``==`` and the version number:
es: También se puede instalar una versión específica de un paquete ingresando el nombre del paquete seguido de ``==`` y el número de versión:

source: If you re-run this command, ``pip`` will notice that the requested version is already installed and do nothing. You can supply a different version number to get that version, or you can run ``python -m pip install --upgrade`` to upgrade the package to the latest version:
es: Si se ejecuta de nuevo el comando, ``pip`` detectará que la versión ya está instalada y no hará nada. Se puede ingresar un número de versión diferente para instalarlo, o se puede ejecutar ``pip install --upgrade`` para actualizar el paquete a la última versión:

source: ``python -m pip uninstall`` followed by one or more package names will remove the packages from the virtual environment.
es: ``pip -m pip uninstall`` seguido de uno o varios nombres de paquetes eliminará los paquetes del entorno virtual.

source: ``python -m pip show`` will display information about a particular package:
es: ``python -m pip show`` mostrará información de un paquete en particular:

source: ``python -m pip list`` will display all of the packages installed in the virtual environment:
es: ``python -m pip list`` mostrará todos los paquetes instalados en el entorno virtual:

source: ``python -m pip freeze`` will produce a similar list of the installed packages, but the output uses the format that ``python -m pip install`` expects. A common convention is to put this list in a ``requirements.txt`` file:
es: ``python -m pip freeze`` retorna una lista de paquetes instalados, pero el formato de salida es el requerido por ``python -m pip install``. Una convención común es poner esta lista en un archivo ``requirements.txt``:

source: The ``requirements.txt`` can then be committed to version control and shipped as part of an application. Users can then install all the necessary packages with ``install -r``:
es: El archivo ``requirements.txt`` puede ser agregado al controlador de versiones y distribuido como parte de la aplicación. Los usuarios pueden entonces instalar todos los paquetes necesarios con ``install -r``:

source: ``pip`` has many more options. Consult the :ref:`installing-index` guide for complete documentation for ``pip``. When you've written a package and want to make it available on the Python Package Index, consult the `Python packaging user guide`_.
es: ``pip`` tiene muchas más opciones. Consulte la guía :ref:`installing-index` para obtener documentación completa de ``pip``. Cuando haya escrito un paquete y desee que esté disponible en el índice de paquetes de Python, consulte la `Guía de usuario de empaquetado de Python`_.
