Repository: erickisos/python-docs-es
Catalog: reference/expressions.po
Languages: es

source: The following table summarizes the operator precedence in Python, from highest precedence (most binding) to lowest precedence (least binding). Operators in the same box have the same precedence. Unless the syntax is explicitly given, operators are binary. Operators in the same box group left to right (except for exponentiation and conditional expressions, which group from right to left).
es: La siguiente tabla resume la precedencia de operadores en Python, desde la precedencia más alta (más vinculante) hasta la precedencia más baja (menos vinculante). Los operadores en el mismo cuadro tienen la misma prioridad. A menos que la sintaxis se proporcione explícitamente, los operadores son binarios. Los operadores en el mismo cuadro se agrupan de izquierda a derecha (excepto la exponenciación y las expresiones condicionales, que se agrupan de derecha a izquierda).

source: Note that comparisons, membership tests, and identity tests, all have the same precedence and have a left-to-right chaining feature as described in the :ref:`comparisons` section.
es: Tenga en cuenta que las comparaciones, comprobaciones de membresía y las comprobaciones de identidad tienen la misma prioridad y una característica de encadenado de izquierda a derecha como son descritas en la sección :ref:`comparisons`.

source: Operator
es: Operador

source: Description
es: Descripción

source: Binding or parenthesized expression, list display, dictionary display, set display
es: Expresión de enlace o entre paréntesis, despliegues de lista, diccionario y conjunto

source: Subscription, slicing, call, attribute reference
es: Subscripción, segmentación, invocación, referencia de atributo

source: Exponentiation [#]_
es: Exponenciación [#]_

source: Positive, negative, bitwise NOT
es: NOT positivo, negativo, bit a bit

source: Multiplication, matrix multiplication, division, floor division, remainder [#]_
es: Multiplicación, multiplicación de matrices, división, división entera a la baja, resto (módulo) [#]_

source: Addition and subtraction
es: Adición y sustracción

source: Shifts
es: Desplazamientos

source: Bitwise AND
es: AND bit a bit

source: Bitwise XOR
es: XOR bit a bit

source: Bitwise OR
es: OR bit a bit

source: Comparisons, including membership tests and identity tests
es: Comparaciones, incluyendo comprobaciones de membresía y de identidad

source: Boolean NOT
es: Booleano NOT

source: Boolean AND
es: Booleano AND

source: Boolean OR
es: Booleano OR

source: Conditional expression
es: Expresión condicional

source: Lambda expression
es: Expresión lambda

source: Assignment expression
es: Expresión de asignación

source: Footnotes
es: Notas al pie

source: While ``abs(x%y) < abs(y)`` is true mathematically, for floats it may not be true numerically due to roundoff. For example, and assuming a platform on which a Python float is an IEEE 754 double-precision number, in order that ``-1e-100 % 1e100`` have the same sign as ``1e100``, the computed result is ``-1e-100 + 1e100``, which is numerically exactly equal to ``1e100``. The function :func:`math.fmod` returns a result whose sign matches the sign of the first argument instead, and so returns ``-1e-100`` in this case. Which approach is more appropriate depends on the application.
es: Mientras ``abs(x%y) < abs(y)`` es matemáticamente verdadero, para números de punto flotante puede no ser verdadero numéricamente debido al redondeo. Por ejemplo, y asumiendo una plataforma en la cual un número de punto flotante de Python es un número de doble precisión IEEE 754, a fin de que ``-1e-100 % 1e100`` tenga el mismo signo que ``1e100``, el resultado calculado es ``-1e-100 + 1e100``, el cual es numéricamente exactamente igual a ``1e100``. La función :func:`math.fmod` retorna un resultado cuyo signo concuerda con el signo del primer argumento en su lugar, y por ello retorna ``-1e-100`` en este caso. La aproximación más apropiada depende de su aplicación.

source: If x is very close to an exact integer multiple of y, it's possible for ``x//y`` to be one larger than ``(x-x%y)//y`` due to rounding. In such cases, Python returns the latter result, in order to preserve that ``divmod(x,y)[0] * y + x % y`` be very close to ``x``.
es: Si x está muy cerca de un entero exacto múltiple de y, es posible para ``x//y`` que sea uno mayor que ``(x-x%y)//y`` debido al redondeo. En tales casos, Python retorna el último resultado, a fin de preservar que ``divmod(x,y)[0] * y + x % y`` sea muy cercano a ``x``.

source: The Unicode standard distinguishes between :dfn:`code points` (e.g. U+0041) and :dfn:`abstract characters` (e.g. "LATIN CAPITAL LETTER A"). While most abstract characters in Unicode are only represented using one code point, there is a number of abstract characters that can in addition be represented using a sequence of more than one code point. For example, the abstract character "LATIN CAPITAL LETTER C WITH CEDILLA" can be represented as a single :dfn:`precomposed character` at code position U+00C7, or as a sequence of a :dfn:`base character` at code position U+0043 (LATIN CAPITAL LETTER C), followed by a :dfn:`combining character` at code position U+0327 (COMBINING CEDILLA).
es: El estándar Unicode distingue entre :dfn:`code points` (ej. U+0041) y :dfn:`abstract characters` (ej. "LETRA MAYÚSCULA LATINA A"). Mientras la mayoría de caracteres abstractos en Unicode sólo son representados usando un punto de código, hay un número de caracteres abstractos que pueden adicionalmente ser representados usado una secuencia de más de un punto de código. Por ejemplo, el caracter abstracto "LETRA MAYÚSCULA C LATINA CON CEDILLA" puede ser representado como un único :dfn:`precomposed character` en la posición de código U+00C7, o como una secuencia de un :dfn:`base character` en la posición de código U+0043 (LETRA MAYÚSCULA C LATINA), seguida de un :dfn:`combining character` en la posición de código U+0327 (CEDILLA COMBINADA).

source: The comparison operators on strings compare at the level of Unicode code points. This may be counter-intuitive to humans. For example, ``"\u00C7" == "\u0043\u0327"`` is ``False``, even though both strings represent the same abstract character "LATIN CAPITAL LETTER C WITH CEDILLA".
es: Los operadores de comparación comparan en cadenas de caracteres al nivel de puntos de código Unicode. Esto puede ser contraintuitivo para humanos. Por ejemplo, ``"\u00C7" == "\u0043\u0327"`` es ``False``, incluso aunque ambas cadenas presenten el mismo caracter abstracto "LETRA MAYÚSCULA C LATINA CON CEDILLA".

source: To compare strings at the level of abstract characters (that is, in a way intuitive to humans), use :func:`unicodedata.normalize`.
es: Para comparar cadenas al nivel de caracteres abstractos (esto es, de una forma intuitiva para humanos), usa :func:`unicodedata.normalize`.

source: Due to automatic garbage-collection, free lists, and the dynamic nature of descriptors, you may notice seemingly unusual behaviour in certain uses of the :keyword:`is` operator, like those involving comparisons between instance methods, or constants. Check their documentation for more info.
es: Debido a la recolección automática de basura, listas libres y a la naturaleza dinámica de los descriptores, puede notar un comportamiento aparentemente inusual en ciertos usos del operador :keyword:`is`, como aquellos involucrando comparaciones entre métodos de instancia, o constantes. Compruebe su documentación para más información.

source: The power operator ``**`` binds less tightly than an arithmetic or bitwise unary operator on its right, that is, ``2**-1`` is ``0.5``.
es: El operador de potencia ``**`` vincula con menos fuerza que un operador unario aritmético uno bit a bit en su derecha, esto significa que ``2**-1`` is ``0.5``.

source: The ``%`` operator is also used for string formatting; the same precedence applies.
es: El operador ``%`` también es usado para formateo de cadenas; aplica la misma prioridad.

source: expression
es: expresiones

source: arithmetic
es: aritméticas

source: conversion
es: conversión

source: identifier
es: identificador

source: exception
es: excepción

source: mangling
es: destrozando

source: private
es: privado

source: names
es: nombres

source: immutable
es: inmutable

source: parenthesized form
es: Formas entre paréntesis

source: () (parentheses)
es: () (paréntesis)

source: tuple display
es: display tupla

source: empty
es: vacío

source: comma
es: coma

source: , (comma)
es: , (coma)

source: comprehensions
es: comprensiones

source: in comprehensions
es: comprensiones in

source: [] (square brackets)
es: [] (paréntesis de corchete)

source: list expression
es: expresión lista

source: expression list
es: expresión lista

source: {} (curly brackets)
es: {} (paréntesis de llave)

source: set expression
es: expresión conjunto

source: dictionary
es: diccionario

source: key
es: llave

source: value
es: valor

source: key/value pair
es: par llave/valor

source: dictionary expression
es: expresión diccionario

source: : (colon)
es: : (dos puntos)

source: in dictionary expressions
es: en expresiones diccionario

source: in dictionary displays
es: en displays de diccionario

source: generator
es: operador

source: generator expression
es: expresión generador

source: function
es: función

source: coroutine
es: corutina

source: yield from expression
es: yield de expresión

source: examples
es: ejemplos

source: asynchronous-generator
es: generador asíncrono

source: primary
es: primario

source: attribute
es: atributo

source: reference
es: referencia

source: . (dot)
es: . (punto)

source: attribute reference
es: referencia de atributo

source: module
es: módulo

source: subscription
es: suscripciones

source: sequence
es: secuencia

source: mapping
es: mapeo

source: string
es: cadena de caracteres

source: character
es: caracter

source: slicing
es: rebanado

source: slice
es: rebanada

source: start (slice object attribute)
es: start (atributo objeto rebanada)

source: stop (slice object attribute)
es: stop (atributo objeto rebanada)

source: step (slice object attribute)
es: step (atributo objeto rebanada)

source: callable
es: llamable

source: call
es: llamada

source: argument
es: argumento

source: call semantics
es: semántica de llamada

source: argument list
es: lista de argumento

source: = (equals)
es: = (igual)

source: in function calls
es: en llamadas de función

source: parameter
es: parámetro

source: * (asterisk)
es: * (asterisco)

source: user-defined
es: definida por el usuario

source: user-defined function
es: función definida por el usuario

source: built-in function
es: función incorporado

source: method
es: método

source: built-in method
es: método incorporado

source: class object
es: objeto de clase

source: class instance
es: instancia de clase

source: instance
es: instancia

source: __call__() (object method)
es: __call__() (método objeto)

source: power
es: potencia

source: operation
es: operación

source: operator
es: operador

source: unary
es: unario

source: bitwise
es: bit a bit

source: negation
es: negación

source: minus
es: menos

source: - (minus)
es: - (menos)

source: unary operator
es: operador unario

source: plus
es: más

source: + (plus)
es: + (más)

source: inversion
es: inversión

source: ~ (tilde)
es: ~ (virgulilla)

source: binary
es: binario

source: multiplication
es: multiplicación

source: matrix multiplication
es: multiplicación de matriz

source: @ (at)
es: @ (arroba)

source: division
es: división

source: / (slash)
es: / (barra diagonal)

source: modulo
es: módulo

source: % (percent)
es: % (porcentaje)

source: addition
es: adición

source: binary operator
es: operador binario

source: subtraction
es: Suscripciones

source: shifting
es: desplazamientos

source: exclusive
es: exclusivo

source: | (vertical bar)
es: | (barra vertical)

source: comparison
es: comparaciones

source: language
es: lenguaje

source: < (less)
es: < (menor)

source: > (greater)
es: > (mayor)

source: chaining
es: encadenamiento

source: comparisons
es: comparaciones

source: membership
es: membresía

source: test
es: prueba

source: identity
es: identidad

source: Conditional
es: Condicional

source: Boolean
es: Booleano

source: := (colon equals)
es: := (dos puntos igual)

source: assignment expression
es: expresión de asignación

source: walrus operator
es: operador morsa

source: named expression
es: expresión con nombre

source: conditional
es: condicional

source: ternary
es: ternario

source: conditional expression
es: expresión condicional

source: form
es: forma

source: anonymous
es: anónimo

source: lambda expression
es: expresión lambda

source: in expression lists
es: en listas de expresión

source: trailing
es: final

source: evaluation
es: evaluación

source: order
es: orden

source: precedence
es: precedencia
