Repository: erickisos/python-docs-es
Catalog: reference/expressions.po
Languages: es

source: When ``yield from <expr>`` is used, the supplied expression must be an iterable. The values produced by iterating that iterable are passed directly to the caller of the current generator's methods. Any values passed in with :meth:`~generator.send` and any exceptions passed in with :meth:`~generator.throw` are passed to the underlying iterator if it has the appropriate methods. If this is not the case, then :meth:`~generator.send` will raise :exc:`AttributeError` or :exc:`TypeError`, while :meth:`~generator.throw` will just raise the passed in exception immediately.
es: Cuando se usa ``yield from <expr>``, la expresión proporcionada debe ser iterable. Los valores producidos al iterar ese iterable se pasan directamente al llamador de los métodos del generador actual. Cualquier valor pasado con :meth:`~generator.send` y cualquier excepción pasada con :meth:`~generator.throw` se pasan al iterador subyacente si tiene los métodos apropiados. Si este no es el caso, entonces :meth:`~generator.send` lanzará :exc:`AttributeError` o :exc:`TypeError`, mientras que :meth:`~generator.throw` solo lanzará la excepción pasada inmediatamente.

source: When the underlying iterator is complete, the :attr:`~StopIteration.value` attribute of the raised :exc:`StopIteration` instance becomes the value of the yield expression. It can be either set explicitly when raising :exc:`StopIteration`, or automatically when the subiterator is a generator (by returning a value from the subgenerator).
es: Cuando el iterador subyacente está completo, el atributo :attr:`~StopIteration.value` de la instancia :exc:`StopIteration` generada se convierte en el valor de la expresión yield. Puede ser establecido explícitamente al generar :exc:`StopIteration` o automáticamente cuando el subiterador es un generador (retornando un valor del subgenerador).

source: Added ``yield from <expr>`` to delegate control flow to a subiterator.
es: Añadido ``yield from <expr>`` para delegar el control de flujo a un subiterador.

source: The parentheses may be omitted when the yield expression is the sole expression on the right hand side of an assignment statement.
es: Los paréntesis pueden ser omitidos cuando la expresión yield es la única expresión en el lado derecho de una sentencia de asignación.

source: :pep:`255` - Simple Generators
es: :pep:`255` - Generadores Simples

source: The proposal for adding generators and the :keyword:`yield` statement to Python.
es: La propuesta para añadir generadores y la sentencia :keyword:`yield` a Python.

source: :pep:`342` - Coroutines via Enhanced Generators
es: :pep:`342` - Corrutinas mediante Generadores Mejorados

source: The proposal to enhance the API and syntax of generators, making them usable as simple coroutines.
es: La propuesta para mejorar la API y la sintaxis de generadores, haciéndolos utilizables como corrutinas simples.

source: :pep:`380` - Syntax for Delegating to a Subgenerator
es: :pep:`380` - Sintaxis para Delegar a un Subgenerador

source: The proposal to introduce the :token:`~python-grammar:yield_from` syntax, making delegation to subgenerators easy.
es: La propuesta para introducir la sintaxis :token:`~python-grammar:yield_from`, facilitando la delegación a subgeneradores.

source: :pep:`525` - Asynchronous Generators
es: :pep:`525`- Generadores Asincrónicos

source: The proposal that expanded on :pep:`492` by adding generator capabilities to coroutine functions.
es: La propuesta que expandió :pep:`492` añadiendo capacidades de generador a las funciones corrutina.

source: Generator-iterator methods
es: Métodos generador-iterador

source: This subsection describes the methods of a generator iterator. They can be used to control the execution of a generator function.
es: Esta subsección describe los métodos de un generador iterador. Estos pueden ser usados para controlar la ejecución de una función generadora.

source: Note that calling any of the generator methods below when the generator is already executing raises a :exc:`ValueError` exception.
es: Tenga en cuenta que invocar cualquiera de los métodos de generador siguientes cuando el generador está todavía en ejecución genera una excepción :exc:`ValueError`.

source: This method is normally called implicitly, e.g. by a :keyword:`for` loop, or by the built-in :func:`next` function.
es: Este método es normalmente invocado implícitamente, por ejemplo, por un bucle :keyword:`for` o por la función incorporada :func:`next`.

source: Resumes the execution and "sends" a value into the generator function. The *value* argument becomes the result of the current yield expression. The :meth:`send` method returns the next value yielded by the generator, or raises :exc:`StopIteration` if the generator exits without yielding another value. When :meth:`send` is called to start the generator, it must be called with :const:`None` as the argument, because there is no yield expression that could receive the value.
es: Reanuda la ejecución y "envía" un valor dentro de la función generadora. El argumento *value* se convierte en el resultado de la expresión yield actual. El método :meth:`send` retorna el siguiente valor producido por el generador o genera :exc:`StopIteration` si el generador termina sin producir otro valor. Cuando se ejecuta :meth:`send` para comenzar el generador, debe ser invocado con :const:`None` como el argumento, debido a que no hay expresión yield que pueda recibir el valor.

source: Raises an exception at the point where the generator was paused, and returns the next value yielded by the generator function. If the generator exits without yielding another value, a :exc:`StopIteration` exception is raised. If the generator function does not catch the passed-in exception, or raises a different exception, then that exception propagates to the caller.
es: Genera una excepción en el punto donde se pausó el generador y devuelve el siguiente valor generado por la función del generador. Si el generador sale sin generar otro valor, se genera una excepción :exc:`StopIteration`. Si la función generadora no detecta la excepción pasada o genera una excepción diferente, esa excepción se propaga a la persona que llama.

source: In typical use, this is called with a single exception instance similar to the way the :keyword:`raise` keyword is used.
es: En el uso típico, esto se llama con una sola instancia de excepción similar a la forma en que se usa la palabra clave :keyword:`raise`.

source: For backwards compatibility, however, the second signature is supported, following a convention from older versions of Python. The *type* argument should be an exception class, and *value* should be an exception instance. If the *value* is not provided, the *type* constructor is called to get an instance. If *traceback* is provided, it is set on the exception, otherwise any existing :attr:`~BaseException.__traceback__` attribute stored in *value* may be cleared.
es: Sin embargo, para la compatibilidad con versiones anteriores, se admite la segunda firma, siguiendo una convención de versiones anteriores de Python. El argumento *type* debe ser una clase de excepción y *value* debe ser una instancia de excepción. Si no se proporciona *value*, se llama al constructor *type* para obtener una instancia. Si se proporciona *traceback*, se establece en la excepción; de lo contrario, se puede borrar cualquier atributo :attr:`~BaseException.__traceback__` existente almacenado en *value*.

source: The second signature \(type\[, value\[, traceback\]\]\) is deprecated and may be removed in a future version of Python.
es: La segunda firma \(type\[, value\[, traceback\]\]\) está obsoleta y puede eliminarse en una versión futura de Python.

source: Examples
es: Ejemplos

source: Here is a simple example that demonstrates the behavior of generators and generator functions::
es: Aquí hay un ejemplo simple que demuestra el comportamiento de generadores y funciones generadoras:

source: For examples using ``yield from``, see :ref:`pep-380` in "What's New in Python."
es: Para ejemplos usando ``yield from``, ver :ref:`pep-380` en "Qué es nuevo en Python."

source: Asynchronous generator functions
es: Funciones generadoras asincrónicas

source: The presence of a yield expression in a function or method defined using :keyword:`async def` further defines the function as an :term:`asynchronous generator` function.
es: La presencia de una expresión yield en una función o método definido usando :keyword:`async def` adicionalmente define la función como una función :term:`asynchronous generator`.

source: When an asynchronous generator function is called, it returns an asynchronous iterator known as an asynchronous generator object. That object then controls the execution of the generator function. An asynchronous generator object is typically used in an :keyword:`async for` statement in a coroutine function analogously to how a generator object would be used in a :keyword:`for` statement.
es: Cuando se invoca una función generadora asincrónica, retorna un iterador asincrónico conocido como un objeto generador asincrónico. Este objeto entonces controla la ejecución de la función generadora. Un objeto generador asincrónico se usa típicamente en una sentencia :keyword:`async for` en una función corrutina análogamente a como sería usado un objeto generador en una sentencia :keyword:`for`.

source: If an asynchronous generator happens to exit early by :keyword:`break`, the caller task being cancelled, or other exceptions, the generator's async cleanup code will run and possibly raise exceptions or access context variables in an unexpected context--perhaps after the lifetime of tasks it depends, or during the event loop shutdown when the async-generator garbage collection hook is called. To prevent this, the caller must explicitly close the async generator by calling :meth:`~agen.aclose` method to finalize the generator and ultimately detach it from the event loop.
es: Si un generador asincrónico sale temprano por :keyword:`break`, la tarea de la persona que llama se cancela u otras excepciones, el código de limpieza asíncrono del generador se ejecutará y posiblemente lanzará excepciones o accederá a variables de contexto en un contexto inesperado, tal vez después de la vida útil de las tareas de las que depende, o durante el cierre del ciclo de eventos cuando se llama al gancho de recolección de basura del generador asíncrono. Para evitar esto, la persona que llama debe cerrar explícitamente el generador asíncrono llamando al método :meth:`~agen.aclose` para finalizar el generador y finalmente desconectarlo del bucle de eventos.

source: In an asynchronous generator function, yield expressions are allowed anywhere in a :keyword:`try` construct. However, if an asynchronous generator is not resumed before it is finalized (by reaching a zero reference count or by being garbage collected), then a yield expression within a :keyword:`!try` construct could result in a failure to execute pending :keyword:`finally` clauses. In this case, it is the responsibility of the event loop or scheduler running the asynchronous generator to call the asynchronous generator-iterator's :meth:`~agen.aclose` method and run the resulting coroutine object, thus allowing any pending :keyword:`!finally` clauses to execute.
es: En una función generadora asincrónica, las expresiones yield están permitidas en cualquier lugar de un constructo :keyword:`try`. Sin embargo, si un generador asincrónico no es reanudado antes de finalizar (alcanzando un contador de referencia cero o recogiendo basura), entonces una expresión yield dentro de un constructo :keyword:`!try` podría fallar al ejecutar cláusulas :keyword:`finally` pendientes. En este caso, es responsabilidad del bucle de eventos o del planificador ejecutando el generador asincrónico invocar el método :meth:`~agen.aclose` del generador-iterador asincrónico y ejecutar el objeto corrutina resultante, permitiendo así la ejecución de cualquier cláusula :keyword:`!finally` pendiente.

source: To take care of finalization upon event loop termination, an event loop should define a *finalizer* function which takes an asynchronous generator-iterator and presumably calls :meth:`~agen.aclose` and executes the coroutine. This *finalizer* may be registered by calling :func:`sys.set_asyncgen_hooks`. When first iterated over, an asynchronous generator-iterator will store the registered *finalizer* to be called upon finalization. For a reference example of a *finalizer* method see the implementation of ``asyncio.Loop.shutdown_asyncgens`` in :source:`Lib/asyncio/base_events.py`.
es: Para encargarse de la finalización tras la finalización del ciclo de eventos, un ciclo de eventos debe definir una función *finalizer* que tome un generador-iterador asíncrono y presumiblemente llame a :meth:`~agen.aclose` y ejecute la rutina. Este *finalizer* se puede registrar llamando a :func:`sys.set_asyncgen_hooks`. Cuando se itera por primera vez, un generador-iterador asíncrono almacenará el *finalizer* registrado para ser llamado al finalizar. Para obtener un ejemplo de referencia de un método *finalizer*, consulte la implementación de ``asyncio.Loop.shutdown_asyncgens`` en :source:`Lib/asyncio/base_events.py`.

source: The expression ``yield from <expr>`` is a syntax error when used in an asynchronous generator function.
es: La expresión ``yield from <expr>`` es un error de sintaxis cuando es usada en una función generadora asincrónica.

source: Asynchronous generator-iterator methods
es: Métodos asincrónicos de generador-iterador

source: This subsection describes the methods of an asynchronous generator iterator, which are used to control the execution of a generator function.
es: Esta subsección describe los métodos de un generador iterador asincrónico, los cuales son usados para controlar la ejecución de una función generadora.

source: This method is normally called implicitly by a :keyword:`async for` loop.
es: Este método es invocado normalmente de forma implícita por un bucle :keyword:`async for`.

source: Returns an awaitable that raises an exception of type ``type`` at the point where the asynchronous generator was paused, and returns the next value yielded by the generator function as the value of the raised :exc:`StopIteration` exception. If the asynchronous generator exits without yielding another value, a :exc:`StopAsyncIteration` exception is raised by the awaitable. If the generator function does not catch the passed-in exception, or raises a different exception, then when the awaitable is run that exception propagates to the caller of the awaitable.
es: Retorna un esperable que genera una excepción de tipo ``type`` en el punto donde el generador asincrónico fue pausado y retorna el siguiente valor yield por la función generadora como el valor de la excepción :exc:`StopIteration` generada. Si el generador asincrónico termina sin yield otro valor, el esperable genera una excepción :exc:`StopAsyncIteration`. Si la función generadora no caza la excepción pasada o genera una excepción diferente, entonces cuando se ejecuta el esperable esa excepción se propaga al invocador del esperable.

source: Returns an awaitable that when run will throw a :exc:`GeneratorExit` into the asynchronous generator function at the point where it was paused. If the asynchronous generator function then exits gracefully, is already closed, or raises :exc:`GeneratorExit` (by not catching the exception), then the returned awaitable will raise a :exc:`StopIteration` exception. Any further awaitables returned by subsequent calls to the asynchronous generator will raise a :exc:`StopAsyncIteration` exception. If the asynchronous generator yields a value, a :exc:`RuntimeError` is raised by the awaitable. If the asynchronous generator raises any other exception, it is propagated to the caller of the awaitable. If the asynchronous generator has already exited due to an exception or normal exit, then further calls to :meth:`aclose` will return an awaitable that does nothing.
es: Retorna un esperable que cuando corre lanza un :exc:`GeneratorExit` a la función generadora asincrónica en el punto donde fue pausada. Si la función generadora asincrónica termina exitosamente, ya está cerrada o genera :exc:`GeneratorExit` (sin cazar la excepción), el esperable retornado lanzará una excepción :exc:`StopIteration`. Otros esperables retornados por subsecuentes invocaciones al generador asincrónico lanzarán una excepción :exc:`StopAsyncIteration`. Si el generador asincrónico yield un valor, el esperable genera un :exc:`RuntimeError`. Si el generador asincrónico genera cualquier otra excepción, esta es propagada al invocador del esperable. Si el generador asincrónico ha terminado debido a una excepción o una terminación normal, entonces futuras invocaciones a :meth:`aclose` retornarán un esperable que no hace nada.

source: Primaries
es: Primarios

source: Primaries represent the most tightly bound operations of the language. Their syntax is:
es: Los primarios representan las operaciones más fuertemente ligadas al lenguaje. Su sintaxis es:

source: Attribute references
es: Referencias de atributos

source: An attribute reference is a primary followed by a period and a name:
es: Una referencia de atributo es un primario seguido de un punto y un nombre:

source: Subscriptions
es: Suscripciones

source: The subscription of an instance of a :ref:`container class <sequence-types>` will generally select an element from the container. The subscription of a :term:`generic class <generic type>` will generally return a :ref:`GenericAlias <types-genericalias>` object.
es: La suscripción de una instancia de un :ref:`container class <sequence-types>` generalmente seleccionará un elemento del contenedor. La suscripción de un :term:`generic class <generic type>` generalmente devolverá un objeto :ref:`GenericAlias <types-genericalias>`.

source: When an object is subscripted, the interpreter will evaluate the primary and the expression list.
es: Cuando se subíndice un objeto, el intérprete evaluará el primario y la lista de expresiones.

source: The primary must evaluate to an object that supports subscription. An object may support subscription through defining one or both of :meth:`~object.__getitem__` and :meth:`~object.__class_getitem__`. When the primary is subscripted, the evaluated result of the expression list will be passed to one of these methods. For more details on when ``__class_getitem__`` is called instead of ``__getitem__``, see :ref:`classgetitem-versus-getitem`.
es: El primario debe evaluarse como un objeto que admita la suscripción. Un objeto puede admitir la suscripción mediante la definición de uno o ambos :meth:`~object.__getitem__` y :meth:`~object.__class_getitem__`. Cuando se subíndice el principal, el resultado evaluado de la lista de expresiones se pasará a uno de estos métodos. Para obtener más detalles sobre cuándo se llama a ``__class_getitem__`` en lugar de ``__getitem__``, consulte :ref:`classgetitem-versus-getitem`.

source: For built-in objects, there are two types of objects that support subscription via :meth:`~object.__getitem__`:
es: Para los objetos integrados, existen dos tipos de objetos que admiten la suscripción a través de :meth:`~object.__getitem__`:

source: Mappings. If the primary is a :term:`mapping`, the expression list must evaluate to an object whose value is one of the keys of the mapping, and the subscription selects the value in the mapping that corresponds to that key. An example of a builtin mapping class is the :class:`dict` class.
es: Mapeos. Si el primario es :term:`mapping`, la lista de expresiones debe evaluarse como un objeto cuyo valor sea una de las claves de la asignación, y la suscripción selecciona el valor en la asignación que corresponde a esa clave. Un ejemplo de una clase de mapeo incorporada es la clase :class:`dict`.

source: Sequences. If the primary is a :term:`sequence`, the expression list must evaluate to an :class:`int` or a :class:`slice` (as discussed in the following section). Examples of builtin sequence classes include the :class:`str`, :class:`list` and :class:`tuple` classes.
es: Secuencias. Si el primario es un :term:`sequence`, la lista de expresiones debe evaluarse como un :class:`int` o un :class:`slice` (como se explica en la siguiente sección). Los ejemplos de clases de secuencia integradas incluyen las clases :class:`str`, :class:`list` y :class:`tuple`.

source: A :class:`string <str>` is a special kind of sequence whose items are *characters*. A character is not a separate data type but a string of exactly one character.
es: Un :class:`string <str>` es un tipo especial de secuencia cuyos elementos son *characters*. Un carácter no es un tipo de datos independiente sino una cadena de exactamente un carácter.

source: Slicings
es: Segmentos

source: A slicing selects a range of items in a sequence object (e.g., a string, tuple or list). Slicings may be used as expressions or as targets in assignment or :keyword:`del` statements. The syntax for a slicing:
es: Un segmento selecciona un rango de elementos en una objeto secuencia (ej., una cadena de caracteres, tupla o lista). Los segmentos pueden ser usados como expresiones o como objetivos en asignaciones o sentencias :keyword:`del`. La sintaxis para un segmento:

source: There is ambiguity in the formal syntax here: anything that looks like an expression list also looks like a slice list, so any subscription can be interpreted as a slicing. Rather than further complicating the syntax, this is disambiguated by defining that in this case the interpretation as a subscription takes priority over the interpretation as a slicing (this is the case if the slice list contains no proper slice).
es: Hay ambigüedad en la sintaxis formal aquí: todo lo que parezca una expresión de lista también parece una segmento de lista, así que cualquier subscripción puede ser interpretada como un segmento. En lugar de complicar aún más la sintaxis, esta es desambiguada definiendo que en este caso la interpretación como una subscripción toma prioridad sobre la interpretación como un segmento (este es el caso si el segmento de lista no contiene un segmento adecuado).

source: Calls
es: Invocaciones

source: A call calls a callable object (e.g., a :term:`function`) with a possibly empty series of :term:`arguments <argument>`:
es: Una invocación invoca un objeto invocable (ej., una :term:`function`) con una serie posiblemente vacía de :term:`argumentos <argument>`:

source: An optional trailing comma may be present after the positional and keyword arguments but does not affect the semantics.
es: Una coma final opcional puede estar presente después de los argumentos posicionales y de palabra clave pero no afecta a las semánticas.
