Repository: erickisos/python-docs-es
Catalog: reference/expressions.po
Languages: es

source: Expressions
es: Expresiones

source: This chapter explains the meaning of the elements of expressions in Python.
es: Este capítulo explica el significado de los elementos de expresiones en Python.

source: **Syntax Notes:** In this and the following chapters, extended BNF notation will be used to describe syntax, not lexical analysis. When (one alternative of) a syntax rule has the form
es: **Notas de Sintaxis:** En este y los siguientes capítulos será usada notación BNF extendida para describir sintaxis, no análisis léxico. Cuando (una alternativa de) una regla de sintaxis tiene la forma

source: and no semantics are given, the semantics of this form of ``name`` are the same as for ``othername``.
es: y no han sido dadas semánticas, las semánticas de esta forma de ``name`` son las mismas que para ``othername``.

source: Arithmetic conversions
es: Conversiones aritméticas

source: When a description of an arithmetic operator below uses the phrase "the numeric arguments are converted to a common type", this means that the operator implementation for built-in types works as follows:
es: Cuando una descripción de un operador aritmético a continuación usa la frase "los argumentos numéricos son convertidos a un tipo común", esto significa que la implementación de operador para tipos incorporados funciona de la siguiente forma:

source: If either argument is a complex number, the other is converted to complex;
es: Si cualquiera de los argumentos es un número complejo, el otro es convertido a complejo;

source: otherwise, both must be integers and no conversion is necessary.
es: de otra forma, ambos deben ser enteros y no se necesita conversión.

source: Some additional rules apply for certain operators (e.g., a string as a left argument to the '%' operator). Extensions must define their own conversion behavior.
es: Algunas reglas adicionales aplican para ciertos operadores (ej., una cadena de caracteres como argumento a la izquierda del operador '%'). Las extensiones deben definir su comportamiento de conversión.

source: Atoms
es: Átomos

source: Atoms are the most basic elements of expressions. The simplest atoms are identifiers or literals. Forms enclosed in parentheses, brackets or braces are also categorized syntactically as atoms. The syntax for atoms is:
es: Los átomos son los elementos más básicos de las expresiones. Los átomos más simples son identificadores o literales. Las formas encerradas en paréntesis, corchetes o llaves son también sintácticamente categorizadas como átomos. La sintaxis para átomos es:

source: Identifiers (Names)
es: Identificadores (Nombres)

source: An identifier occurring as an atom is a name. See section :ref:`identifiers` for lexical definition and section :ref:`naming` for documentation of naming and binding.
es: Un identificador encontrándose como un átomo es un nombre. Vea la sección :ref:`identifiers` para la definición léxica y la sección :ref:`naming` para documentación de nombrar y vincular.

source: When the name is bound to an object, evaluation of the atom yields that object. When a name is not bound, an attempt to evaluate it raises a :exc:`NameError` exception.
es: Cuando el nombre es vinculado a un objeto, la evaluación del átomo yields ese objeto. Cuando un nombre no es vinculado, un intento de evaluarlo genera una excepción :exc:`NameError`.

source: Literals
es: Literales

source: Python supports string and bytes literals and various numeric literals:
es: Python soporta literales de cadenas de caracteres y bytes y varios literales numéricos:

source: All literals correspond to immutable data types, and hence the object's identity is less important than its value. Multiple evaluations of literals with the same value (either the same occurrence in the program text or a different occurrence) may obtain the same object or a different object with the same value.
es: Todos los literales corresponden a tipos de datos inmutables y, por lo tanto, la identidad del objeto es menos importante que su valor. Múltiples evaluaciones de literales con el mismo valor (ya sea la misma ocurrencia en el texto del programa o una ocurrencia diferente) pueden obtener el mismo objeto o un objeto diferente con el mismo valor.

source: Parenthesized forms
es: Formas entre paréntesis

source: A parenthesized form is an optional expression list enclosed in parentheses:
es: Una forma entre paréntesis es una lista de expresiones opcionales encerradas entre paréntesis:

source: A parenthesized expression list yields whatever that expression list yields: if the list contains at least one comma, it yields a tuple; otherwise, it yields the single expression that makes up the expression list.
es: Una expresión entre paréntesis yields lo que la lista de expresión yields: si la lista contiene al menos una coma, produce una tupla; en caso contrario, yields la única expresión que que forma la lista de expresiones.

source: An empty pair of parentheses yields an empty tuple object. Since tuples are immutable, the same rules as for literals apply (i.e., two occurrences of the empty tuple may or may not yield the same object).
es: Un par de paréntesis vacío yields un objeto de tupla vacío. Debido a que las tuplas son inmutables, se aplican las mismas reglas que aplican para literales (ej., dos ocurrencias de una tupla vacía puede o no yields el mismo objeto).

source: Note that tuples are not formed by the parentheses, but rather by use of the comma. The exception is the empty tuple, for which parentheses *are* required --- allowing unparenthesized "nothing" in expressions would cause ambiguities and allow common typos to pass uncaught.
es: Tenga en cuenta que las tuplas no se forman con paréntesis, sino mediante el uso de coma. La excepción es la tupla vacía, para la cual *se* requieren paréntesis. Permitir "nada" sin paréntesis en las expresiones causaría ambigüedades y permitiría que errores tipográficos comunes pasaran sin detectarse.

source: Displays for lists, sets and dictionaries
es: Despliegues para listas, conjuntos y diccionarios

source: For constructing a list, a set or a dictionary Python provides special syntax called "displays", each of them in two flavors:
es: Para construir una lista, un conjunto o un diccionario, Python provee sintaxis especial denominada "despliegue", cada una de ellas en dos sabores:

source: either the container contents are listed explicitly, or
es: los contenidos del contenedor son listados explícitamente o

source: they are computed via a set of looping and filtering instructions, called a :dfn:`comprehension`.
es: son calculados mediante un conjunto de instrucciones de bucle y filtrado, denominadas una :dfn:`comprehension`.

source: Common syntax elements for comprehensions are:
es: Los elementos comunes de sintaxis para las comprensiones son:

source: The comprehension consists of a single expression followed by at least one :keyword:`!for` clause and zero or more :keyword:`!for` or :keyword:`!if` clauses. In this case, the elements of the new container are those that would be produced by considering each of the :keyword:`!for` or :keyword:`!if` clauses a block, nesting from left to right, and evaluating the expression to produce an element each time the innermost block is reached.
es: La comprensión consiste en una única expresión seguida por al menos una cláusula :keyword:`!for` y cero o más cláusulas :keyword:`!for` o :keyword:`!if`. En este caso, los elementos del nuevo contenedor son aquellos que serían producidos mediante considerar cada una de las cláusulas :keyword:`!for` o :keyword:`!if` un bloque, anidado de izquierda a derecha y evaluando la expresión para producir un elemento cada vez que se alcanza el bloque más interno.

source: However, aside from the iterable expression in the leftmost :keyword:`!for` clause, the comprehension is executed in a separate implicitly nested scope. This ensures that names assigned to in the target list don't "leak" into the enclosing scope.
es: Sin embargo, aparte de la expresión iterable en la cláusula :keyword:`!for` más a la izquierda, la comprensión es ejecutada en un alcance separado implícitamente anidado. Esto asegura que los nombres asignados a en la lista objetiva no se "filtren" en el alcance adjunto.

source: The iterable expression in the leftmost :keyword:`!for` clause is evaluated directly in the enclosing scope and then passed as an argument to the implicitly nested scope. Subsequent :keyword:`!for` clauses and any filter condition in the leftmost :keyword:`!for` clause cannot be evaluated in the enclosing scope as they may depend on the values obtained from the leftmost iterable. For example: ``[x*y for x in range(10) for y in range(x, x+10)]``.
es: La expresión iterable en la cláusula más a la izquierda :keyword:`!for` es evaluada directamente en el alcance anidado y luego pasada como un argumento al alcance implícitamente anidado. Subsecuentes cláusulas :keyword:`!for` y cualquier condición de filtro en la cláusula :keyword:`!for` más a la izquierda no pueden ser evaluadas en el alcance adjunto ya que pueden depender de los valores obtenidos del iterable de más a la izquierda. Por ejemplo, ``[x*y for x in range(10) for y in range(x, x+10)]``.

source: To ensure the comprehension always results in a container of the appropriate type, ``yield`` and ``yield from`` expressions are prohibited in the implicitly nested scope.
es: Para asegurar que la comprensión siempre resulta en un contenedor del tipo apropiado, las expresiones ``yield`` y ``yield from`` están prohibidas en el alcance implícitamente anidado.

source: Asynchronous comprehensions were introduced.
es: Fueron introducidas las comprensiones asincrónicas.

source: ``yield`` and ``yield from`` prohibited in the implicitly nested scope.
es: Prohibidas ``yield`` y ``yield from`` en el alcance implícitamente anidado.

source: Asynchronous comprehensions are now allowed inside comprehensions in asynchronous functions. Outer comprehensions implicitly become asynchronous.
es: Las comprensiones asincrónicas ahora están permitidas dentro de las comprensiones en funciones asincrónicas. Las comprensiones externas implícitamente se vuelven asincrónicas.

source: List displays
es: Despliegues de lista

source: A list display is a possibly empty series of expressions enclosed in square brackets:
es: Un despliegue de lista es una serie de expresiones posiblemente vacía encerrada entre corchetes:

source: A list display yields a new list object, the contents being specified by either a list of expressions or a comprehension. When a comma-separated list of expressions is supplied, its elements are evaluated from left to right and placed into the list object in that order. When a comprehension is supplied, the list is constructed from the elements resulting from the comprehension.
es: Un despliegue de lista produce un nuevo objeto lista, el contenido se especifica por una lista de expresiones o una comprensión. Cuando se proporciona una lista de expresiones, sus elementos son evaluados desde la izquierda a la derecha y colocados en el objeto lista en ese orden. Cuando se proporciona una comprensión, la lista es construida desde los elementos resultantes de la comprensión.

source: Set displays
es: Despliegues de conjuntos

source: A set display is denoted by curly braces and distinguishable from dictionary displays by the lack of colons separating keys and values:
es: Un despliegue de conjunto se denota mediante llaves y se distinguen de los despliegues de diccionarios por la ausencia de caracteres de doble punto separando claves y valores:

source: A set display yields a new mutable set object, the contents being specified by either a sequence of expressions or a comprehension. When a comma-separated list of expressions is supplied, its elements are evaluated from left to right and added to the set object. When a comprehension is supplied, the set is constructed from the elements resulting from the comprehension.
es: Un despliegue de conjunto produce un nuevo objeto conjunto mutable, el contenido se especifica mediante una secuencia de expresiones o una comprensión. Cuando se proporciona una lista de expresiones separadas por comas, sus elementos son evaluados desde la izquierda a la derecha y añadidos al objeto de conjunto. Cuando se proporciona una comprensión, el conjunto es construido de los elementos resultantes de la comprensión.

source: An empty set cannot be constructed with ``{}``; this literal constructs an empty dictionary.
es: Un conjunto vacío no puede ser construido con ``{}``; este literal construye un diccionario vacío.

source: Dictionary displays
es: Despliegues de diccionario

source: A dictionary display is a possibly empty series of dict items (key/value pairs) enclosed in curly braces:
es: La visualización de un diccionario es una serie posiblemente vacía de elementos de dictado (pares clave/valor) encerrados entre llaves:

source: A dictionary display yields a new dictionary object.
es: Un despliegue de diccionario produce un nuevo objeto diccionario.

source: If a comma-separated sequence of dict items is given, they are evaluated from left to right to define the entries of the dictionary: each key object is used as a key into the dictionary to store the corresponding value. This means that you can specify the same key multiple times in the dict item list, and the final dictionary's value for that key will be the last one given.
es: Si se proporciona una secuencia de elementos dict separados por comas, se evalúan de izquierda a derecha para definir las entradas del diccionario: cada objeto clave se utiliza como clave en el diccionario para almacenar el valor correspondiente. Esto significa que puede especificar la misma clave varias veces en la lista de elementos de dictado, y el valor final del diccionario para esa clave será el último que se proporcione.

source: A double asterisk ``**`` denotes :dfn:`dictionary unpacking`. Its operand must be a :term:`mapping`. Each mapping item is added to the new dictionary. Later values replace values already set by earlier dict items and earlier dictionary unpackings.
es: Un asterisco doble ``**`` indica :dfn:`descomprimiendo el diccionario`. Su operando debe ser un :term:`mapping`. Cada elemento de mapeo se agrega al nuevo diccionario. Los valores posteriores reemplazan los valores ya establecidos por elementos de dictado anteriores y desempaquetados de diccionarios anteriores.

source: Unpacking into dictionary displays, originally proposed by :pep:`448`.
es: Desempaquetar en despliegues de diccionarios, originalmente propuesto por :pep:`448`.

source: A dict comprehension, in contrast to list and set comprehensions, needs two expressions separated with a colon followed by the usual "for" and "if" clauses. When the comprehension is run, the resulting key and value elements are inserted in the new dictionary in the order they are produced.
es: Una comprensión de diccionario, en contraste a las compresiones de lista y conjunto, necesita dos expresiones separadas con un caracter de doble punto seguido por las cláusulas usuales "for" e "if". Cuando la comprensión se ejecuta, los elementos resultantes clave y valor son insertados en el nuevo diccionario en el orden que son producidos.

source: Restrictions on the types of the key values are listed earlier in section :ref:`types`. (To summarize, the key type should be :term:`hashable`, which excludes all mutable objects.) Clashes between duplicate keys are not detected; the last value (textually rightmost in the display) stored for a given key value prevails.
es: Las restricciones sobre los tipos de valores clave se enumeran anteriormente en la sección :ref:`types`. (En resumen, el tipo de clave debe ser :term:`hashable`, que excluye todos los objetos mutables). No se detectan conflictos entre claves duplicadas; prevalece el último valor (textualmente más a la derecha en la pantalla) almacenado para un valor clave determinado.

source: Prior to Python 3.8, in dict comprehensions, the evaluation order of key and value was not well-defined. In CPython, the value was evaluated before the key. Starting with 3.8, the key is evaluated before the value, as proposed by :pep:`572`.
es: Antes de Python 3.8, en las comprensiones de diccionarios, el orden de evaluación de clave y valor no fue bien definido. En CPython, el valor fue evaluado antes de la clave. A partir de 3.8, la clave es evaluada antes que el valor, como fue propuesto por :pep:`572`.

source: Generator expressions
es: Expresiones de generador

source: A generator expression is a compact generator notation in parentheses:
es: Una expresión de generador es una notación compacta de generador en paréntesis:

source: A generator expression yields a new generator object. Its syntax is the same as for comprehensions, except that it is enclosed in parentheses instead of brackets or curly braces.
es: Una expresión de generador produce un nuevo objeto generador. Su sintaxis es la misma que para las comprensiones, excepto que es encerrado en paréntesis en lugar de corchetes o llaves.

source: Variables used in the generator expression are evaluated lazily when the :meth:`~generator.__next__` method is called for the generator object (in the same fashion as normal generators). However, the iterable expression in the leftmost :keyword:`!for` clause is immediately evaluated, so that an error produced by it will be emitted at the point where the generator expression is defined, rather than at the point where the first value is retrieved. Subsequent :keyword:`!for` clauses and any filter condition in the leftmost :keyword:`!for` clause cannot be evaluated in the enclosing scope as they may depend on the values obtained from the leftmost iterable. For example: ``(x*y for x in range(10) for y in range(x, x+10))``.
es: Las variables usadas en la expresión de generador son evaluadas perezosamente cuando se ejecuta el método :meth:`~generator.__next__` para el objeto generador (de la misma forma que los generadores normales). Sin embargo, la expresión iterable en la cláusula :keyword:`!for` más a la izquierda es inmediatamente evaluada, de forma que un error producido por ella será emitido en el punto en el que se define la expresión de generador, en lugar de en el punto donde se obtiene el primer valor. Subsecuentes cláusulas :keyword:`!for` y cualquier condición en la cláusula :keyword:`!for` más a la izquierda no pueden ser evaluadas en el alcance adjunto, ya que puede depender de los valores obtenidos por el iterable de más a la izquierda. Por ejemplo: ``(x*y for x in range(10) for y in range(x, x+10))``.

source: The parentheses can be omitted on calls with only one argument. See section :ref:`calls` for details.
es: Los paréntesis pueden ser omitidos en ejecuciones con un solo argumento. Vea la sección :ref:`calls` para más detalles.

source: To avoid interfering with the expected operation of the generator expression itself, ``yield`` and ``yield from`` expressions are prohibited in the implicitly defined generator.
es: Para evitar interferir con la operación esperada de la expresión misma del generador, las expresiones ``yield`` y ``yield from`` están prohibidas en el generador definido implícitamente.

source: If a generator expression contains either :keyword:`!async for` clauses or :keyword:`await` expressions it is called an :dfn:`asynchronous generator expression`. An asynchronous generator expression returns a new asynchronous generator object, which is an asynchronous iterator (see :ref:`async-iterators`).
es: Si una expresión de generador contiene cláusulas :keyword:`!async for` o expresiones :keyword:`await`, se ejecuta una :dfn:`asynchronous generator expression`. Una expresión de generador asincrónica retorna un nuevo objeto de generador asincrónico, el cual es un iterador asincrónico (ver :ref:`async-iterators`).

source: Asynchronous generator expressions were introduced.
es: Las expresiones de generador asincrónico fueron introducidas.

source: Prior to Python 3.7, asynchronous generator expressions could only appear in :keyword:`async def` coroutines. Starting with 3.7, any function can use asynchronous generator expressions.
es: Antes de Python 3.7, las expresiones de generador asincrónico podrían aparecer sólo en corrutinas :keyword:`async def`. Desde 3.7, cualquier función puede usar expresiones de generador asincrónico.

source: Yield expressions
es: Expresiones yield

source: The yield expression is used when defining a :term:`generator` function or an :term:`asynchronous generator` function and thus can only be used in the body of a function definition. Using a yield expression in a function's body causes that function to be a generator function, and using it in an :keyword:`async def` function's body causes that coroutine function to be an asynchronous generator function. For example::
es: La expresión yield se usa al definir una función :term:`generator` o una función :term:`asynchronous generator` y, por lo tanto, solo se puede usar en el cuerpo de una definición de función. El uso de una expresión yield en el cuerpo de una función hace que esa función sea una función generadora, y su uso en el cuerpo de una función :keyword:`async def` hace que la función corrutina sea una función generadora asíncrona. Por ejemplo::

source: Due to their side effects on the containing scope, ``yield`` expressions are not permitted as part of the implicitly defined scopes used to implement comprehensions and generator expressions.
es: Debido a sus efectos secundarios sobre el alcance contenedor, las expresiones ``yield`` no están permitidas como parte de los alcances implícitamente definidos usados para implementar comprensiones y expresiones de generador.

source: Yield expressions prohibited in the implicitly nested scopes used to implement comprehensions and generator expressions.
es: Expresiones yield prohibidas en los ámbitos anidados implícitamente utilizados para implementar comprensiones y expresiones de generador.

source: Generator functions are described below, while asynchronous generator functions are described separately in section :ref:`asynchronous-generator-functions`.
es: Las funciones generadoras son descritas a continuación, mientras que las funciones generadoras asincrónicas son descritas separadamente en la sección :ref:`asynchronous-generator-functions`.

source: All of this makes generator functions quite similar to coroutines; they yield multiple times, they have more than one entry point and their execution can be suspended. The only difference is that a generator function cannot control where the execution should continue after it yields; the control is always transferred to the generator's caller.
es: Todo este hace a las funciones generadores similar a las corrutinas; yield múltiples veces, tienen más de un punto de entrada y su ejecución puede ser suspendida. La única diferencia es que una función generadora no puede controlar si la ejecución debe continuar después de yield; el control siempre es transferido al invocador del generador.

source: Yield expressions are allowed anywhere in a :keyword:`try` construct. If the generator is not resumed before it is finalized (by reaching a zero reference count or by being garbage collected), the generator-iterator's :meth:`~generator.close` method will be called, allowing any pending :keyword:`finally` clauses to execute.
es: Las expresiones yield están permitidas en cualquier lugar en un constructo :keyword:`try`. Si el generador no es reanudado antes de finalizar (alcanzando un recuento de referencia cero o colectando basura), el método generador-iterador :meth:`~generator.close` será invocado, permitiendo la ejecución de cualquier cláusula :keyword:`finally` pendiente.
