Repository: erickisos/python-docs-es
Catalog: reference/expressions.po
Languages: es

source: Chapter :ref:`objects` states that objects have a value (in addition to type and identity). The value of an object is a rather abstract notion in Python: For example, there is no canonical access method for an object's value. Also, there is no requirement that the value of an object should be constructed in a particular way, e.g. comprised of all its data attributes. Comparison operators implement a particular notion of what the value of an object is. One can think of them as defining the value of an object indirectly, by means of their comparison implementation.
es: El capítulo :ref:`objects` afirma que los objetos tienen un valor (en adición al tipo e identidad). El valor de un objeto es una noción bastante abstracta en Python: Por ejemplo, no existe un método de acceso canónico para el valor de un objeto. Además, no se requiere que el valor de un objeto deba ser construido de una forma particular, ej. compuesto de todos sus atributos de datos. Los operadores de comparación implementan una noción particular de lo que es el valor de un objeto. Uno puede pensar en ellos definiendo el valor de un objeto indirectamente, mediante su implementación de comparación.

source: The default behavior for equality comparison (``==`` and ``!=``) is based on the identity of the objects. Hence, equality comparison of instances with the same identity results in equality, and equality comparison of instances with different identities results in inequality. A motivation for this default behavior is the desire that all objects should be reflexive (i.e. ``x is y`` implies ``x == y``).
es: El comportamiento predeterminado para comparación de igualdad (``==`` y ``!=``) se basa en la identidad de los objetos. Por lo tanto, la comparación de instancias con la misma identidad resulta en igualdad, y la comparación de igualdad de instancias con diferentes entidades resulta en desigualdad. Una motivación para este comportamiento predeterminado es el deseo de que todos los objetos sean reflexivos (ej. ``x is y`` implica ``x == y``).

source: A default order comparison (``<``, ``>``, ``<=``, and ``>=``) is not provided; an attempt raises :exc:`TypeError`. A motivation for this default behavior is the lack of a similar invariant as for equality.
es: No se provee un orden de comparación por defecto (``<``, ``>``, ``<=``, and ``>=``); un intento genera :exc:`TypeError`. Una motivación para este comportamiento predeterminado es la falta de una invariante similar como para la igualdad.

source: The behavior of the default equality comparison, that instances with different identities are always unequal, may be in contrast to what types will need that have a sensible definition of object value and value-based equality. Such types will need to customize their comparison behavior, and in fact, a number of built-in types have done that.
es: El comportamiento de la comparación de igualdad predeterminado, que instancias con diferentes identidades siempre son desiguales, puede estar en contraste a que los tipos que necesitarán que tengan una definición sensata de valor de objeto e igualdad basada en el valor. Tales tipos necesitarán personalizar su comportamiento de comparación y, de hecho, un número de tipos incorporados lo han realizado.

source: The following list describes the comparison behavior of the most important built-in types.
es: La siguiente lista describe el comportamiento de comparación de los tipos incorporados más importantes.

source: Numbers of built-in numeric types (:ref:`typesnumeric`) and of the standard library types :class:`fractions.Fraction` and :class:`decimal.Decimal` can be compared within and across their types, with the restriction that complex numbers do not support order comparison. Within the limits of the types involved, they compare mathematically (algorithmically) correct without loss of precision.
es: Números de tipos numéricos incorporadas (:ref:`typesnumeric`) y tipos de la biblioteca estándar :class:`fractions.Fraction` y :class:`decimal.Decimal` pueden ser comparados consigo mismos y entre sus tipos, con la restricción de que números complejos no soportan orden de comparación. Dentro de los límites de los tipos involucrados, se comparan matemáticamente (algorítmicamente) correctos sin pérdida de precisión.

source: The not-a-number values ``float('NaN')`` and ``decimal.Decimal('NaN')`` are special. Any ordered comparison of a number to a not-a-number value is false. A counter-intuitive implication is that not-a-number values are not equal to themselves. For example, if ``x = float('NaN')``, ``3 < x``, ``x < 3`` and ``x == x`` are all false, while ``x != x`` is true. This behavior is compliant with IEEE 754.
es: Los valores no-un-número ``float('NaN')`` y ``decimal.Decimal('NaN')`` son especiales. Cualquier comparación ordenada de un número a un no-un-número es falsa. Una implicación contraintuitiva es que los valores no-un-número son son iguales a sí mismos. Por ejemplo, si ``x = float('NaN')``, ``3 < x``, ``x < 3`` y ``x == x`` son todos falso, mientras ``x != x`` es verdadero. Este comportamiento cumple con IEEE 754.

source: Binary sequences (instances of :class:`bytes` or :class:`bytearray`) can be compared within and across their types. They compare lexicographically using the numeric values of their elements.
es: Las secuencias binarias (instancias de :class:`bytes` o :class:`bytearray`) pueden ser comparadas entre sí y con otros tipos. Ellas comparan lexicográficamente utilizando los valores numéricos de sus elementos.

source: Strings (instances of :class:`str`) compare lexicographically using the numerical Unicode code points (the result of the built-in function :func:`ord`) of their characters. [#]_
es: Las cadenas de caracteres (instancias de :class:`str`) comparan lexicográficamente usando los puntos de códigos numéricos Unicode (el resultado de la función incorporada :func:`ord`) o sus caracteres. [#]_

source: Strings and binary sequences cannot be directly compared.
es: Las cadenas de caracteres y las secuencias binarias no pueden ser comparadas directamente.

source: Sequences (instances of :class:`tuple`, :class:`list`, or :class:`range`) can be compared only within each of their types, with the restriction that ranges do not support order comparison. Equality comparison across these types results in inequality, and ordering comparison across these types raises :exc:`TypeError`.
es: Las secuencias (instancias de :class:`tuple`, :class:`list`, o :class:`range`) pueden ser comparadas sólo entre cada uno de sus tipos, con la restricción de que los rangos no soportan comparación de orden. Comparación de igualdad entre esos tipos resulta en desigualdad y la comparación de orden entre esos tipos genera :exc:`TypeError`.

source: Sequences compare lexicographically using comparison of corresponding elements. The built-in containers typically assume identical objects are equal to themselves. That lets them bypass equality tests for identical objects to improve performance and to maintain their internal invariants.
es: Las secuencias comparan lexicográficamente usando comparación de sus correspondientes elementos. Los contenedores incorporados asumen que los objetos idénticos son iguales a sí mismos. Eso les permite omitir las pruebas de igualdad para objetos idénticos para mejorar el rendimiento y mantener sus invariantes internos.

source: Lexicographical comparison between built-in collections works as follows:
es: La comparación lexicográfica entre colecciones incorporadas funciona de la siguiente forma:

source: For two collections to compare equal, they must be of the same type, have the same length, and each pair of corresponding elements must compare equal (for example, ``[1,2] == (1,2)`` is false because the type is not the same).
es: Para que dos colecciones sean comparadas iguales, ellas deben ser del mismo tipo, tener el mismo largo, y cada para de elementos correspondientes deben comparar iguales (por ejemplo, ``[1,2] == (1,2)`` es falso debido a que el tipo no es el mismo).

source: Collections that support order comparison are ordered the same as their first unequal elements (for example, ``[1,2,x] <= [1,2,y]`` has the same value as ``x <= y``). If a corresponding element does not exist, the shorter collection is ordered first (for example, ``[1,2] < [1,2,3]`` is true).
es: Las colecciones que soportan comparación de orden son ordenadas igual que sus primeros elementos desiguales (por ejemplo, ``[1,2,x] <= [1,2,y]`` tiene el mismo valor que ``x <= y``). Si un elemento correspondiente no existe, la colección más corta es ordenada primero (por ejemplo, ``[1,2] < [1,2,3]`` es verdadero).

source: Mappings (instances of :class:`dict`) compare equal if and only if they have equal ``(key, value)`` pairs. Equality comparison of the keys and values enforces reflexivity.
es: Las asignaciones (instancias de :class:`dict`) se comparan iguales si y solo si tienen pares ``(key, value)`` iguales. La comparación equitativa de las claves y los valores impone la reflexividad.

source: Order comparisons (``<``, ``>``, ``<=``, and ``>=``) raise :exc:`TypeError`.
es: Comparaciones de orden (``<``, ``>``, ``<=``, and ``>=``) generan :exc:`TypeError`.

source: Sets (instances of :class:`set` or :class:`frozenset`) can be compared within and across their types.
es: Conjuntos (instancias de :class:`set` o :class:`frozenset`) pueden ser comparadas entre sí y entre sus tipos.

source: They define order comparison operators to mean subset and superset tests. Those relations do not define total orderings (for example, the two sets ``{1,2}`` and ``{2,3}`` are not equal, nor subsets of one another, nor supersets of one another). Accordingly, sets are not appropriate arguments for functions which depend on total ordering (for example, :func:`min`, :func:`max`, and :func:`sorted` produce undefined results given a list of sets as inputs).
es: Ellas definen operadores de comparación de orden con la intención de comprobar subconjuntos y superconjuntos. Tales relaciones no definen ordenaciones completas (por ejemplo, los dos conjuntos ``{1,2}`` y ``{2,3}`` no son iguales, ni subconjuntos ni superconjuntos uno de otro). Acordemente, los conjuntos no son argumentos apropiados para funciones que dependen de ordenación completa (por ejemplo, :func:`min`, :func:`max` y :func:`sorted` producen resultados indefinidos dados una lista de conjuntos como entradas).

source: Comparison of sets enforces reflexivity of its elements.
es: La comparación de conjuntos refuerza la reflexibilidad de sus elementos.

source: Most other built-in types have no comparison methods implemented, so they inherit the default comparison behavior.
es: La mayoría de los otros tipos incorporados no tienen métodos de comparación implementados, por lo que ellos heredan el comportamiento de comparación predeterminado.

source: User-defined classes that customize their comparison behavior should follow some consistency rules, if possible:
es: Las clases definidas por el usuario que personalizan su comportamiento de comparación deben seguir algunas reglas de consistencia, si es posible:

source: Equality comparison should be reflexive. In other words, identical objects should compare equal:
es: La comparación de igualdad debe ser reflexiva. En otras palabras, los objetos idénticos deben comparar iguales:

source: ``x is y`` implies ``x == y``
es: ``x is y`` implica ``x == y``

source: Comparison should be symmetric. In other words, the following expressions should have the same result:
es: La comparación debe ser simétrica. En otras palabras, las siguientes expresiones deben tener el mismo resultado:

source: ``x == y`` and ``y == x``
es: ``x == y`` y ``y == x``

source: ``x != y`` and ``y != x``
es: ``x != y`` y ``y != x``

source: ``x < y`` and ``y > x``
es: ``x < y`` y ``y > x``

source: ``x <= y`` and ``y >= x``
es: ``x <= y`` y ``y >= x``

source: Comparison should be transitive. The following (non-exhaustive) examples illustrate that:
es: La comparación debe ser transitiva. Los siguientes ejemplos (no exhaustivos) ilustran esto:

source: ``x > y and y > z`` implies ``x > z``
es: ``x > y and y > z`` implica ``x > z``

source: ``x < y and y <= z`` implies ``x < z``
es: ``x < y and y <= z`` implica ``x < z``

source: Inverse comparison should result in the boolean negation. In other words, the following expressions should have the same result:
es: La comparación inversa debe resultar en la negación booleana. En otras palabras, las siguientes expresiones deben tener el mismo resultado:

source: ``x == y`` and ``not x != y``
es: ``x == y`` y ``not x != y``

source: ``x < y`` and ``not x >= y`` (for total ordering)
es: ``x < y`` y ``not x >= y`` (para ordenación completa)

source: ``x > y`` and ``not x <= y`` (for total ordering)
es: ``x > y`` y ``not x <= y`` (para ordenación completa)

source: The last two expressions apply to totally ordered collections (e.g. to sequences, but not to sets or mappings). See also the :func:`~functools.total_ordering` decorator.
es: Las últimas dos expresiones aplican a colecciones completamente ordenadas (ej. a secuencias, pero no a conjuntos o mapeos). Vea también el decorador :func:`~functools.total_ordering`.

source: The :func:`hash` result should be consistent with equality. Objects that are equal should either have the same hash value, or be marked as unhashable.
es: La función :func:`hash` debe ser consistente con la igualdad. Los objetos que son iguales deben tener el mismo valor de hash o ser marcados como inhashables.

source: Python does not enforce these consistency rules. In fact, the not-a-number values are an example for not following these rules.
es: Python no fuerza a cumplir esas reglas de coherencia. De hecho, los valores no-un-número son u ejemplo para no seguir esas reglas.

source: Membership test operations
es: Operaciones de prueba de membresía

source: The operators :keyword:`in` and :keyword:`not in` test for membership. ``x in s`` evaluates to ``True`` if *x* is a member of *s*, and ``False`` otherwise. ``x not in s`` returns the negation of ``x in s``. All built-in sequences and set types support this as well as dictionary, for which :keyword:`!in` tests whether the dictionary has a given key. For container types such as list, tuple, set, frozenset, dict, or collections.deque, the expression ``x in y`` is equivalent to ``any(x is e or x == e for e in y)``.
es: Los operadores :keyword:`in` y :keyword:`not in` comprueban membresía. ``x in s`` evalúa a ``True`` si *x* es un miembro de *s* y ``False`` en caso contrario. ``x not in s`` retorna la negación de ``x in s``. Todas las secuencias incorporadas y tipos conjuntos soportan esto, así como diccionarios, para los cuales :keyword:`!in` comprueba si un diccionario tiene una clave dada. Para tipos contenedores como list, tuple, set, frozenset, dict o collections.deque, la expresión ``x in y`` es equivalente a ``any(x is e or x == e for e in y)``.

source: For the string and bytes types, ``x in y`` is ``True`` if and only if *x* is a substring of *y*. An equivalent test is ``y.find(x) != -1``. Empty strings are always considered to be a substring of any other string, so ``"" in "abc"`` will return ``True``.
es: Para los tipos cadenas de caracteres y bytes, ``x in y`` es ``True`` si y sólo si *x* es una subcadena de *y*. Una comprobación equivalente es ``y.find(x) != -1``. Las cadenas de caracteres vacías siempre son consideradas como subcadenas de cualquier otra cadena de caracteres, por lo que ``"" in "abc"`` retornará ``True``.

source: The operator :keyword:`not in` is defined to have the inverse truth value of :keyword:`in`.
es: El operador :keyword:`not in` es definido para tener el valor de veracidad inverso de :keyword:`in`.

source: Identity comparisons
es: Comparaciones de identidad

source: The operators :keyword:`is` and :keyword:`is not` test for an object's identity: ``x is y`` is true if and only if *x* and *y* are the same object. An Object's identity is determined using the :meth:`id` function. ``x is not y`` yields the inverse truth value. [#]_
es: Los operadores :keyword:`is` y :keyword:`is not` comprueban la identidad de un objeto. ``x is y`` es verdadero si y sólo si *x* e *y* son el mismo objeto. La identidad de un Objeto se determina usando la función :meth:`id`. ``x is not y`` yield el valor de veracidad inverso. [#]_

source: Boolean operations
es: Operaciones booleanas

source: In the context of Boolean operations, and also when expressions are used by control flow statements, the following values are interpreted as false: ``False``, ``None``, numeric zero of all types, and empty strings and containers (including strings, tuples, lists, dictionaries, sets and frozensets). All other values are interpreted as true. User-defined objects can customize their truth value by providing a :meth:`~object.__bool__` method.
es: En el contexto de operaciones booleanas, y también cuando las declaraciones de flujo de control utilizan expresiones, los siguientes valores se interpretan como falsos: ``False``, ``None``, cero numérico de todos los tipos y cadenas y contenedores vacíos (incluidas cadenas, tuplas, listas, diccionarios). , conjuntos y conjuntos congelados). Todos los demás valores se interpretan como verdaderos. Los objetos definidos por el usuario pueden personalizar su valor de verdad proporcionando un método :meth:`~object.__bool__`.

source: The operator :keyword:`not` yields ``True`` if its argument is false, ``False`` otherwise.
es: El operador :keyword:`not` yield ``True`` si su argumento es falso, ``False`` si no.

source: The expression ``x and y`` first evaluates *x*; if *x* is false, its value is returned; otherwise, *y* is evaluated and the resulting value is returned.
es: La expresión ``x and y`` primero evalúa *x*; si *x* es falso, se retorna su valor; de otra forma, *y* es evaluado y se retorna el valor resultante.

source: The expression ``x or y`` first evaluates *x*; if *x* is true, its value is returned; otherwise, *y* is evaluated and the resulting value is returned.
es: La expresión ``x or y`` primero evalúa *x*; si *x* es verdadero, se retorna su valor; de otra forma, *y* es evaluado y se retorna el valor resultante.

source: Note that neither :keyword:`and` nor :keyword:`or` restrict the value and type they return to ``False`` and ``True``, but rather return the last evaluated argument. This is sometimes useful, e.g., if ``s`` is a string that should be replaced by a default value if it is empty, the expression ``s or 'foo'`` yields the desired value. Because :keyword:`not` has to create a new value, it returns a boolean value regardless of the type of its argument (for example, ``not 'foo'`` produces ``False`` rather than ``''``.)
es: Tenga en cuenta que ni :keyword:`and` ni :keyword:`or` restringen el valor y el tipo que retornan a ``False`` y ``True``, sino retornan el último argumento evaluado. Esto es útil a veces, ej., si ``s`` es una cadena de caracteres que debe ser remplazada por un valor predeterminado si está vacía, la expresión ``s or 'foo'`` yield el valor deseado. Debido a que :keyword:`not` tiene que crear un nuevo valor, retorna un valor booleano indiferentemente del tipo de su argumento (por ejemplo, ``not 'foo'`` produce ``False`` en lugar de ``''``.)

source: Assignment expressions
es: Expresiones de asignación

source: An assignment expression (sometimes also called a "named expression" or "walrus") assigns an :token:`~python-grammar:expression` to an :token:`~python-grammar:identifier`, while also returning the value of the :token:`~python-grammar:expression`.
es: Una expresión de asignación (a veces también llamada "expresión con nombre" o "morsa") asigna un :token:`~python-grammar:expression` a un :token:`~python-grammar:identifier`, al mismo tiempo que devuelve el valor de el :token:`~python-grammar:expresión`.

source: One common use case is when handling matched regular expressions:
es: Un caso de uso común es cuando se manejan expresiones regulares coincidentes:

source: Or, when processing a file stream in chunks:
es: O, al procesar un flujo de archivos en fragmentos:

source: See :pep:`572` for more details about assignment expressions.
es: Vea :pep:`572` para más detalles sobre las expresiones de asignación.

source: Conditional expressions
es: Expresiones condicionales

source: Conditional expressions (sometimes called a "ternary operator") have the lowest priority of all Python operations.
es: Las expresiones condicionales (a veces denominadas un "operador ternario") tienen la prioridad más baja que todas las operaciones de Python.

source: The expression ``x if C else y`` first evaluates the condition, *C* rather than *x*. If *C* is true, *x* is evaluated and its value is returned; otherwise, *y* is evaluated and its value is returned.
es: La expresión ``x if C else y`` primero evalúa la condición, *C* en lugar de *x*. Si *C* es verdadero, *x* es evaluado y se retorna su valor; en caso contrario, *y* es evaluado y se retorna su valor.

source: See :pep:`308` for more details about conditional expressions.
es: Vea :pep:`308` para más detalles sobre expresiones condicionales.

source: Lambda expressions (sometimes called lambda forms) are used to create anonymous functions. The expression ``lambda parameters: expression`` yields a function object. The unnamed object behaves like a function object defined with:
es: Las expresiones lambda (a veces denominadas formas lambda) son usadas para crear funciones anónimas. La expresión ``lambda parameters: expression`` yield un objeto de función. El objeto sin nombre se comporta como un objeto función con:

source: See section :ref:`function` for the syntax of parameter lists. Note that functions created with lambda expressions cannot contain statements or annotations.
es: Vea la sección :ref:`function` para la sintaxis de listas de parámetros. Tenga en cuenta que las funciones creadas con expresiones lambda no pueden contener sentencias ni anotaciones.

source: Expression lists
es: Listas de expresiones

source: Except when part of a list or set display, an expression list containing at least one comma yields a tuple. The length of the tuple is the number of expressions in the list. The expressions are evaluated from left to right.
es: Excepto cuando son parte de un despliegue de lista o conjunto, una lista de expresión conteniendo al menos una coma yield una tupla. El largo de la tupla es el número de expresiones en la lista. Las expresiones son evaluadas de izquierda a derecha.

source: An asterisk ``*`` denotes :dfn:`iterable unpacking`. Its operand must be an :term:`iterable`. The iterable is expanded into a sequence of items, which are included in the new tuple, list, or set, at the site of the unpacking.
es: Un asterisco ``*`` denota :dfn:`iterable unpacking`. Su operando deben ser un :term:`iterable`. El iterable es expandido en una secuencia de elementos, los cuales son incluidos en la nueva tupla, lista o conjunto en el lugar del desempaquetado.

source: Iterable unpacking in expression lists, originally proposed by :pep:`448`.
es: Desempaquetado iterable en listas de expresiones, originalmente propuesto por :pep:`488`.

source: Evaluation order
es: Orden de evaluación

source: Python evaluates expressions from left to right. Notice that while evaluating an assignment, the right-hand side is evaluated before the left-hand side.
es: Python evalúa las expresiones de izquierda a derecha. Note que mientras se evalúa una asignación, la parte derecha es evaluada antes que la parte izquierda.

source: In the following lines, expressions will be evaluated in the arithmetic order of their suffixes::
es: En las siguientes líneas, las expresiones serán evaluadas en el orden aritmético de sus sufijos::

source: Operator precedence
es: Prioridad de operador
