Repository: erickisos/python-docs-es
Catalog: library/asyncio.po
Languages: es_es

source: High-level APIs
es_es: *APIs* de alto nivel

source: Low-level APIs
es_es: *APIs* de bajo nivel

source: Guides and Tutorials
es_es: Guías y tutoriales

source: Hello World!
es_es: ¡Hola Mundo!

source: asyncio is a library to write **concurrent** code using the **async/await** syntax.
es_es: asyncio es una biblioteca para escribir código **concurrente** utilizando la sintaxis **async/await**.

source: asyncio is used as a foundation for multiple Python asynchronous frameworks that provide high-performance network and web-servers, database connection libraries, distributed task queues, etc.
es_es: asyncio es utilizado como base en múltiples *frameworks* asíncronos de Python y provee un alto rendimiento en redes y servidores web, bibliotecas de conexión de base de datos, colas de tareas distribuidas, etc.

source: asyncio is often a perfect fit for IO-bound and high-level **structured** network code.
es_es: asyncio suele encajar perfectamente para operaciones con límite de E/S y código de red **estructurado** de alto nivel.

source: asyncio provides a set of **high-level** APIs to:
es_es: asyncio provee un conjunto de *APIs* de **alto nivel** para:

source: :ref:`run Python coroutines <coroutine>` concurrently and have full control over their execution;
es_es: :ref:`ejecutar corutinas de Python <coroutine>` de manera concurrente y tener control total sobre su ejecución;

source: perform :ref:`network IO and IPC <asyncio-streams>`;
es_es: realizar :ref:`redes E/S y comunicación entre procesos(IPC) <asyncio-streams>`;

source: control :ref:`subprocesses <asyncio-subprocess>`;
es_es: controlar :ref:`subprocesos <asyncio-subprocess>`;

source: distribute tasks via :ref:`queues <asyncio-queues>`;
es_es: distribuir tareas a través de :ref:`colas <asyncio-queues>`;

source: :ref:`synchronize <asyncio-sync>` concurrent code;
es_es: :ref:`sincronizar <asyncio-sync>` código concurrente;

source: Additionally, there are **low-level** APIs for *library and framework developers* to:
es_es: Adicionalmente, existen *APIs* de **bajo nivel** para *desarrolladores de bibliotecas y frameworks* para:

source: implement efficient protocols using :ref:`transports <asyncio-transports-protocols>`;
es_es: implementar protocolos eficientes utilizando :ref:`transportes <asyncio-transports-protocols>`;

source: :ref:`bridge <asyncio-futures>` callback-based libraries and code with async/await syntax.
es_es: Bibliotecas :ref:`puente <asyncio-futures>` basadas en retrollamadas y código con sintaxis *async/wait*.

source: Reference
es_es: Referencias

source: The source code for asyncio can be found in :source:`Lib/asyncio/`.
es_es: El código fuente para asyncio puede encontrarse en :source:`Lib/asyncio/`.
