Repository: erickisos/python-docs-es
Catalog: library/symtable.po
Languages: es

source: **Source code:** :source:`Lib/symtable.py`
es: **Código fuente:** :source:`Lib/symtable.py`

source: Symbol tables are generated by the compiler from AST just before bytecode is generated. The symbol table is responsible for calculating the scope of every identifier in the code. :mod:`symtable` provides an interface to examine these tables.
es: Las tablas de símbolos son generadas por el compilador a partir del AST justo antes de que el bytecode sea generado. La tabla de símbolos es responsable de calcular el ámbito de cada identificador en el código. :mod:`symtable` provee una interfaz para examinar esas tablas.

source: Generating Symbol Tables
es: Generando tablas de símbolos

source: Return the toplevel :class:`SymbolTable` for the Python source *code*. *filename* is the name of the file containing the code. *compile_type* is like the *mode* argument to :func:`compile`.
es: Retorna la :class:`SymbolTable` del nivel más alto para el código Python *code*. *filename* es el nombre del archivo conteniendo el código. *compile_type* es como el argumento *mode* de la función :func:`compile`.

source: Examining Symbol Tables
es: Examinando la tabla de símbolos

source: A namespace table for a block. The constructor is not public.
es: Un espacio de nombres para el bloque. El constructor no es público.

source: Added ``'annotation'``, ``'TypeVar bound'``, ``'type alias'``, and ``'type parameter'`` as possible return values.
es: Se agregaron ``'annotation'``, ``'TypeVar bound'``, ``'type alias'`` y ``'type parameter'`` como posibles valores de retorno.

source: Return the table's identifier.
es: Retorna el identificador de la tabla.

source: Return the table's name. This is the name of the class if the table is for a class, the name of the function if the table is for a function, or ``'top'`` if the table is global (:meth:`get_type` returns ``'module'``). For type parameter scopes (which are used for generic classes, functions, and type aliases), it is the name of the underlying class, function, or type alias. For type alias scopes, it is the name of the type alias. For :class:`~typing.TypeVar` bound scopes, it is the name of the ``TypeVar``.
es: Retorna el nombre de la tabla. Es el nombre de la clase si la tabla es para una clase, el nombre de la función si la tabla es para una función o ``'top`` si la tabla es global (:meth:`get_type` retorna ``'module``). Para ámbitos de parámetros de tipo (que se utilizan para clases genéricas, funciones y alias de tipo), es el nombre de la clase, función o alias de tipo subyacente. Para ámbitos de alias de tipo, es el nombre del alias de tipo. Para ámbitos enlazados :class:`~typing.TypeVar`, es el nombre del ``TypeVar``.

source: Return the number of the first line in the block this table represents.
es: Retorna el número de la primera línea en el bloque que esta tabla representa.

source: Return ``True`` if the locals in this table can be optimized.
es: Retorna ``True`` si los locales en esta tabla pueden ser optimizados.

source: Return ``True`` if the block is a nested class or function.
es: Retorna ``True`` si el bloque es una clase o función anidadas.

source: Return ``True`` if the block has nested namespaces within it. These can be obtained with :meth:`get_children`.
es: Retorna ``True`` si el bloque contiene espacios de nombres anidados en él. Estos pueden ser obtenidos con :meth:`get_children`.

source: Return a view object containing the names of symbols in the table. See the :ref:`documentation of view objects <dict-views>`.
es: Retorna una vista de objeto que contiene los nombres de los símbolos en la tabla. Lee la :ref:`documentación de vistas de objetos <dict-views>`.

source: Lookup *name* in the table and return a :class:`Symbol` instance.
es: Busca *name* en la tabla y retorna una instancia de :class:`Symbol`.

source: Return a list of :class:`Symbol` instances for names in the table.
es: Retorna una lista de instancias de :class:`Symbol` de los nombres en la tabla.

source: Return a list of the nested symbol tables.
es: Retorna una lista de las tablas de símbolos anidadas.

source: Return a tuple containing names of parameters to this function.
es: Retorna una tupla conteniendo los nombres de los parámetros de esta función.

source: Return a tuple containing names of locals in this function.
es: Retorna una tupla conteniendo los nombres de los locales en esta función.

source: Return a tuple containing names of globals in this function.
es: Retorna una tupla conteniendo los nombres de los globales en esta función.

source: Return a tuple containing names of nonlocals in this function.
es: Retorna una tupla conteniendo los nombres de los no locales en esta función.

source: Return a tuple containing names of free variables in this function.
es: Retorna una tupla conteniendo los nombres de las variables libres en esta función.

source: An entry in a :class:`SymbolTable` corresponding to an identifier in the source. The constructor is not public.
es: Una entrada en una :class:`SymbolTable` correspondiente a un identificador en el código. El constructor no es público.

source: Return the symbol's name.
es: Retorna el nombre del símbolo.

source: Return ``True`` if the symbol is used in its block.
es: Retorna ``True`` si el símbolo es usado en su bloque.

source: Return ``True`` if the symbol is created from an import statement.
es: Retorna ``True`` si el símbolo es creado desde una instrucción *import*.

source: Return ``True`` if the symbol is a parameter.
es: Retorna ``True`` si el símbolo es un parámetro.

source: Return ``True`` if the symbol is global.
es: Retorna ``True`` si el símbolo es global.

source: Return ``True`` if the symbol is nonlocal.
es: Retorna ``True`` si el símbolo es no local.

source: Return ``True`` if the symbol is declared global with a global statement.
es: Retorna ``True`` si el símbolo es declarado global con una instrucción *global*.

source: Return ``True`` if the symbol is local to its block.
es: Retorna ``True`` si el símbolo es local a su bloque.

source: Return ``True`` if the symbol is annotated.
es: Retorna ``True`` si el símbolo está anotado.

source: Return ``True`` if the symbol is referenced in its block, but not assigned to.
es: Retorna ``True`` si el símbolo es referenciado en su bloque pero no asignado.

source: Return ``True`` if the symbol is assigned to in its block.
es: Retorna ``True`` si el símbolo es asignado en su bloque.

source: Return ``True`` if name binding introduces new namespace.
es: Retorna ``True`` si la vinculación de nombres introduce un nuevo espacio de nombres.

source: If the name is used as the target of a function or class statement, this will be true.
es: Si el nombre es usado como objetivo de una instrucción *function* o *class* retornará verdadero.

source: For example::
es: Por ejemplo::

source: Note that a single name can be bound to multiple objects. If the result is ``True``, the name may also be bound to other objects, like an int or list, that does not introduce a new namespace.
es: Note que un solo nombre puede estar vinculado a varios objetos. Si el resultado es ``True``, el nombre puede estar vinculado también a otros objetos, como un entero o una lista, esto no introduce un nuevo espacio de nombres.

source: Return a list of namespaces bound to this name.
es: Retorna una lista de espacios de nombres vinculados a este nombre.

source: Return the namespace bound to this name. If more than one or no namespace is bound to this name, a :exc:`ValueError` is raised.
es: Retorna el espacio de nombre vinculado a este nombre. Si hay más de un espacio de nombre vinculado o ninguno a ese nombre se levanta un :exc:`ValueError`.
